## Pandas - Operations

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666])

In [5]:
len(df['col2'].unique())

3

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Conditional Selections

In [8]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [9]:
df[df['col1']>3]

   col1  col2 col3
3     4   444  xyz

In [12]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [13]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

### Apply method

In [14]:
def times2(x):
    return x*2

In [15]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

- Apply method will broad cast any function in the apply() method to each element and return the output.

In [16]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [17]:
df['col1'].apply(lambda x: x > 200)

0    False
1    False
2    False
3    False
Name: col1, dtype: bool

In [18]:
df.apply(lambda x: x > 200)

TypeError: '>' not supported between instances of 'str' and 'int'

In [19]:
df['col2'].apply(lambda x: x > 200)

0    True
1    True
2    True
3    True
Name: col2, dtype: bool

### Remove columns

In [21]:
df.drop('col1', axis=1)
# need inplace=true if need to change the original df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### Other Operations

In [22]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [25]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [26]:
df.dropna()
# Drop NaN values

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Fill in NaN values

In [27]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [28]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [30]:
df.head(1)
# returns first n rows, default 5

   col1  col2 col3
0   1.0   NaN  abc

In [31]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

### Pivot Table

In [33]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [34]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [36]:
df.pivot_table(values='D', index=['A', 'C'], columns=['B'])

B      one  two
A   C
bar x  4.0  NaN
    y  1.0  5.0
foo x  1.0  2.0
    y  3.0  NaN

In [37]:
df.pivot_table(values='D', index=['B', 'C'], columns=['A'])

A      bar  foo
B   C
one x  4.0  1.0
    y  1.0  3.0
two x  NaN  2.0
    y  5.0  NaN

In [38]:
df.pivot_table(values='D', index=['C', 'B'], columns=['A'])

A      bar  foo
C B
x one  4.0  1.0
  two  NaN  2.0
y one  1.0  3.0
  two  5.0  NaN